[
  {
    "id": "1",
    "image": "https://www.technovimal.in/apps/fast-english/assets/listening.webp",
    "title": "Listening",
    "body": "One of the key elements of learning a language is listening. Listening is both an active and passive form of learning. As we hear words being pronounced and used in sentences, we absorb information that we store for future use. Listening is a skill that is easy to incorporate into your daily life. If you have the opportunity to spend time in an English speaking country, you will have the benefit of listening to the language all around you.\n\nIf not, you can listen to English music and watch English TV shows and movies. These are passive forms of listening, background noise that you absorb without even realizing it. Learning a new language also requires active listening, in which you carefully focus to understand the meaning of each word and the entire sentence. Often times, listening is the first step to speaking. If you are engaging in a conversation, you have to listen in order to respond.",
    "date": "16-Jan-2022"
  },
  {
    "id": "2",
    "image": "https://www.technovimal.in/apps/fast-english/assets/reading.webp",
    "title": "Reading",
    "body": "Similar to listening, reading is an important way to absorb the English language. The beauty of listening and reading is that you do not have to produce any language on your own. Instead, you are consuming the language and storing knowledge for you to later use as building blocks for writing and speaking.",
    "date": "16-Jan-2022"
  },
  {
    "id": "3",
   "image": "https://www.technovimal.in/apps/fast-english/assets/writing.webp",
    "title": "Writing",
    "body": "The third skill of language learning is writing. This is more difficult to learn, as it takes time, patience, and repetition. Writing is an opportunity to use the words you’ve learned and produce the English language on your own. Unlike reading and listening where the content is provided for you, writing requires you to create something new. This can be difficult when you are first learning English. One way to practice writing is to pick themes or topics and give yourself assignments. This can help jump start your creativity and keep your studies engaging and challenging.",
    "date": "16-Jan-2022"
  },
  {
    "id": "4",
    "image": "https://www.technovimal.in/apps/fast-english/assets/speaking.webp",
    "title": "Speaking",
    "body": "The fourth language learning skill is speaking. Like writing, English speaking requires you to produce your own content. It also requires you to use the other skills you’ve learned, in particular listening. The important thing to remember is that speaking a new language doesn’t have to be perfect. Unlike writing, where you can edit your words and fix mistakes, speaking is free-flowing and less polished. While that might sound more challenging, it actually works in your benefit. When speaking, you can rely on the words and concepts you are most comfortable with, mastering these as you build on your language abilities.",
    "date": "16-Jan-2022"
  },
  {
    "id": "5",
    "image": "https://www.technovimal.in/apps/fast-english/assets/tips-50.webp",
    "title": "Tips for Speaking English Fluently and Confidently",
    "body": "Here you will find a brief list of 50 simple tips for speaking English fluently:\n\n1. Be realistic about your English learning goals\n2. Practice speaking as well, not just reading and listening\n3. Practice speaking English whenever you get a chance\n4. Get native English-speaking friends and practice speaking with them\n5. Do not be afraid of making mistakes\n6. Use simple sentences at first, then progress to more complex sentences\n7. Get a reliable English learning course\n8. Make an effort to improve your pronunciation\n9. Try saying something extra\n10. Learn from your mistakes\n11. Listen to English-language music\n12. Learn some English tongue twisters\n13. Accept English and all its uniqueness\n14. Try learning some new words every day\n15. Try some public speaking\n16. Let English be all around you\n17. Become part of a conversation group\n18. Read your favorite books aloud\n19. Watch videos of popular songs online\n20. Try thinking in English\n21. Practice paraphrasing\n22. Conduct small talk in English\n23. Try creating your own responses, rather than repeating what people say\n24. Have confidence whenever you speak\n25. Learn to listen better\n26. Substitute phrasal verbs for regular verbs\n27. Be passionate about English\n28. Try to learn from everyone\n29. Learn from your favorite personality or public speaker\n30. Watch children’s cartoons\n31. Don’t focus on speaking exclusively\n32. If you haven’t done so already, change the language on your computer/phone to English\n33. Learn some short natural responses\n34. Follow the news\n35. Record yourself speaking and have friends listen and comment on the recording\n36. Be ready for specific situations\n37. Make learning English fun\n38. Practice speaking English in front of a mirror\n39. Learn to say things in your own way\n40. Master some specific phrases and English Idioms\n41. Try writing based on new things you have learned\n42. Retell a story or a joke in English\n43. Engage in English activities\n44. Debate in English\n45. Don’t rush your speech\n46. Listen and try to sing along to rap music\n47. Try interrupting and interjecting politely\n48. Understand that there is always room for improvement\n49. Speak the English you know\n50. Try to be realistic",
    "date": "16-Jan-2022"
  }
]